## Terraform Checks (Prod)
#### Format Check 📏`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
cloudflare_record.github_verify[0]: Refreshing state... [id=84925091b850b50163d1d337f2fd81c5]
module.cloudflare-zerotrust.cloudflare_tunnel.clancy: Refreshing state... [id=9caf2b66-1e02-482d-b325-40c34d55e0c2]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp: Refreshing state... [id=50b72fee-0b55-4445-8a40-ab27d77e383b]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.github: Refreshing state... [id=f634c4de-f06b-4050-980b-39faa1115418]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_application.application: Refreshing state... [id=6cee466e-9ab2-4d61-a760-9fdbef0682ee]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application: Refreshing state... [id=5e88ddf0-ec74-47ad-a75e-2fbc650d0fcc]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_application.application: Refreshing state... [id=2c358ab2-6213-46f0-b037-df26f5faaef3]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application: Refreshing state... [id=326c177c-a5e4-4818-a86a-65f094eb21d0]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application: Refreshing state... [id=5d67eda7-bf1b-4814-a3f1-b30565fc3cb3]
module.cloudflare-zerotrust.cloudflare_record.access_app_status: Refreshing state... [id=6787e5741e04f6cb44134afd413d9250]
module.cloudflare-zerotrust.cloudflare_record.access_app_clancyadmin: Refreshing state... [id=1f4611359f30760769738ffc35c46898]
module.cloudflare-zerotrust.cloudflare_record.access_app_ha: Refreshing state... [id=6278a34b9d053a548a174ded805bdf69]
module.cloudflare-zerotrust.cloudflare_record.access_app_unifi: Refreshing state... [id=d3ff69a56bbe6c42afaa024887f1a415]
module.cloudflare-zerotrust.cloudflare_record.access_app_homeradmin: Refreshing state... [id=03bb9f063c57328fe9d6c6635c9412d0]
module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy: Refreshing state... [id=9caf2b66-1e02-482d-b325-40c34d55e0c2]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.github_policy: Refreshing state... [id=aa8bdcd6-2827-4e80-9c06-dfeaa41c4249]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy: Refreshing state... [id=e991e3ba-ec04-4dad-8863-827363c56b5b]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_policy.github_policy: Refreshing state... [id=8c269554-2014-48ed-8a10-24af3f920f8b]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.github_policy: Refreshing state... [id=b6b249b1-968b-4088-85f3-0bc2127d19a9]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.github_policy: Refreshing state... [id=cc0cd438-1603-475a-a476-c245157e26df]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.disk_encryption_macos will be created
  + resource "cloudflare_device_posture_rule" "disk_encryption_macos" {
      + account_id  = (sensitive value)
      + description = "Check FileVault is enabled"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "Disk Encryption (macOS)"
      + schedule    = "24h"
      + type        = "disk_encryption"

      + input {
          + check_disks = [
              + "/",
              + "/System/Volumes/Data",
            ]
          + enabled     = (known after apply)
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + require_all = (known after apply)
          + running     = (known after apply)
        }

      + match {
          + platform = "mac"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.disk_encryption_windows will be created
  + resource "cloudflare_device_posture_rule" "disk_encryption_windows" {
      + account_id  = (sensitive value)
      + description = "Check BitLocker is enabled"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "Disk Encryption (Windows)"
      + schedule    = "24h"
      + type        = "disk_encryption"

      + input {
          + check_disks = [
              + "C:",
            ]
          + enabled     = (known after apply)
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + require_all = (known after apply)
          + running     = (known after apply)
        }

      + match {
          + platform = "windows"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.firewall_macos will be created
  + resource "cloudflare_device_posture_rule" "firewall_macos" {
      + account_id  = (sensitive value)
      + description = "Check macOS firewall is enabled"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "Firewall (macOS)"
      + schedule    = "24h"
      + type        = "firewall"

      + input {
          + enabled     = true
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + require_all = (known after apply)
          + running     = (known after apply)
        }

      + match {
          + platform = "mac"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.firewall_windows will be created
  + resource "cloudflare_device_posture_rule" "firewall_windows" {
      + account_id  = (sensitive value)
      + description = "Check Windows firewall is enabled"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "Firewall (Windows)"
      + schedule    = "24h"
      + type        = "firewall"

      + input {
          + enabled     = true
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + require_all = (known after apply)
          + running     = (known after apply)
        }

      + match {
          + platform = "windows"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.gateway will be created
  + resource "cloudflare_device_posture_rule" "gateway" {
      + account_id  = (sensitive value)
      + description = "Check device is using Cloudflare Zero Trust Gateway"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "Zero Trust Gateway"
      + schedule    = "24h"
      + type        = "gateway"
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_android will be created
  + resource "cloudflare_device_posture_rule" "os_version_android" {
      + account_id  = (sensitive value)
      + description = "Check Android version meets or exceeds minimum"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "OS Version (Android)"
      + schedule    = "24h"
      + type        = "os_version"

      + input {
          + enabled     = (known after apply)
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + operator    = ">="
          + require_all = (known after apply)
          + running     = (known after apply)
          + version     = "14.0.0"
        }

      + match {
          + platform = "android"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_ios will be created
  + resource "cloudflare_device_posture_rule" "os_version_ios" {
      + account_id  = (sensitive value)
      + description = "Check iOS version meets or exceeds minimum"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "OS Version (iOS)"
      + schedule    = "24h"
      + type        = "os_version"

      + input {
          + enabled     = (known after apply)
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + operator    = ">="
          + require_all = (known after apply)
          + running     = (known after apply)
          + version     = "17.1.1"
        }

      + match {
          + platform = "ios"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_macos will be created
  + resource "cloudflare_device_posture_rule" "os_version_macos" {
      + account_id  = (sensitive value)
      + description = "Check macOS version meets or exceeds minimum"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "OS Version (macOS)"
      + schedule    = "24h"
      + type        = "os_version"

      + input {
          + enabled     = (known after apply)
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + operator    = ">="
          + require_all = (known after apply)
          + running     = (known after apply)
          + version     = "13.5.1"
        }

      + match {
          + platform = "mac"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_posture_rule.os_version_windows will be created
  + resource "cloudflare_device_posture_rule" "os_version_windows" {
      + account_id  = (sensitive value)
      + description = "Check Windows version meets or exceeds minimum"
      + expiration  = "24h"
      + id          = (known after apply)
      + name        = "OS Version (Windows)"
      + schedule    = "24h"
      + type        = "os_version"

      + input {
          + enabled     = (known after apply)
          + exists      = (known after apply)
          + infected    = (known after apply)
          + is_active   = (known after apply)
          + operator    = ">="
          + require_all = (known after apply)
          + running     = (known after apply)
          + version     = "10.0.22621"
        }

      + match {
          + platform = "windows"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_device_settings_policy.morrislan_settings will be created
  + resource "cloudflare_device_settings_policy" "morrislan_settings" {
      + account_id           = (sensitive value)
      + allow_mode_switch    = false
      + allow_updates        = true
      + allowed_to_leave     = true
      + auto_connect         = 5
      + captive_portal       = 5
      + default              = true
      + description          = "Default WARP profile for accessing MorrisLAN resources"
      + enabled              = true
      + id                   = (known after apply)
      + name                 = "MorrisLAN WARP Profile"
      + service_mode_v2_mode = "warp"
      + service_mode_v2_port = 3000
      + switch_locked        = true
    }

  # module.cloudflare-zerotrust.cloudflare_split_tunnel.morrislan will be created
  + resource "cloudflare_split_tunnel" "morrislan" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + mode       = "include"

      + tunnels {
          + address     = "10.1.240.0/24"
          + description = "MorrisLAN"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_split_tunnel.morrislan_iot will be created
  + resource "cloudflare_split_tunnel" "morrislan_iot" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + mode       = "include"

      + tunnels {
          + address     = "10.1.241.0/24"
          + description = "MorrisLAN-IOT"
        }
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy will be updated in-place
  ~ resource "cloudflare_tunnel_config" "clancy" {
        id         = "9caf2b66-1e02-482d-b325-40c34d55e0c2"
        # (2 unchanged attributes hidden)

      ~ config {
          - warp_routing {
              - enabled = true -> null
            }

            # (6 unchanged blocks hidden)
        }
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_route.morrislan will be created
  + resource "cloudflare_tunnel_route" "morrislan" {
      + account_id         = (sensitive value)
      + comment            = "MorrisLAN"
      + id                 = (known after apply)
      + network            = "10.1.240.0/24"
      + tunnel_id          = "9caf2b66-1e02-482d-b325-40c34d55e0c2"
      + virtual_network_id = (known after apply)
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_route.morrislan_iot will be created
  + resource "cloudflare_tunnel_route" "morrislan_iot" {
      + account_id         = (sensitive value)
      + comment            = "MorrisLAN-IOT"
      + id                 = (known after apply)
      + network            = "10.1.241.0/24"
      + tunnel_id          = "9caf2b66-1e02-482d-b325-40c34d55e0c2"
      + virtual_network_id = (known after apply)
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_virtual_network.morrislan_cloud will be created
  + resource "cloudflare_tunnel_virtual_network" "morrislan_cloud" {
      + account_id         = (sensitive value)
      + comment            = "Default virtual network for accessing MorrisLAN resources"
      + id                 = (known after apply)
      + is_default_network = true
      + name               = "MorrisLAN-Cloud"
    }

  # module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.device_policy[0] will be created
  + resource "cloudflare_access_policy" "device_policy" {
      + account_id                     = (known after apply)
      + application_id                 = "6cee466e-9ab2-4d61-a760-9fdbef0682ee"
      + decision                       = "allow"
      + id                             = (known after apply)
      + name                           = "Clancy Admin (prod) Device Policy"
      + precedence                     = 10
      + purpose_justification_required = false
      + session_duration               = "24h"
      + zone_id                        = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = "f634c4de-f06b-4050-980b-39faa1115418"
              + name                 = "MorrisLAN"
            }
        }

      + require {
          + device_posture = (known after apply)
        }
    }

  # module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.device_policy[0] will be created
  + resource "cloudflare_access_policy" "device_policy" {
      + account_id                     = (known after apply)
      + application_id                 = "2c358ab2-6213-46f0-b037-df26f5faaef3"
      + decision                       = "allow"
      + id                             = (known after apply)
      + name                           = "Homer Admin (prod) Device Policy"
      + precedence                     = 10
      + purpose_justification_required = false
      + session_duration               = "24h"
      + zone_id                        = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = "f634c4de-f06b-4050-980b-39faa1115418"
              + name                 = "MorrisLAN"
            }
        }

      + require {
          + device_posture = (known after apply)
        }
    }

  # module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.device_policy[0] will be created
  + resource "cloudflare_access_policy" "device_policy" {
      + account_id                     = (known after apply)
      + application_id                 = "326c177c-a5e4-4818-a86a-65f094eb21d0"
      + decision                       = "allow"
      + id                             = (known after apply)
      + name                           = "UniFi (prod) Device Policy"
      + precedence                     = 10
      + purpose_justification_required = false
      + session_duration               = "24h"
      + zone_id                        = "8eaa1d30ab4bcae4d54f9ac6886ae26b"

      + include {
          + github {
              + identity_provider_id = "f634c4de-f06b-4050-980b-39faa1115418"
              + name                 = "MorrisLAN"
            }
        }

      + require {
          + device_posture = (known after apply)
        }
    }

Plan: 18 to add, 1 to change, 0 to destroy.

```

</details>
